app/controllers/greetings_api_controller.rb

  def index
    render json: Greeting.order('RANDOM()').first.to_json
---
SELECT "greetings".* FROM "greetings" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]